app/Models/ModelAuth.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'ambon'
AND `password` = 'a1c680519228f21a806204f9d39e1446d4440a9b'
---
    public function loginUser($username,$password)
    {
        return $this->db->table('tbl_user')
        ->where('username',$username)
        ->where('password',$password)
        ->get()->getRowArray();