app/Models/ModelSlider.php

SELECT *
FROM `tbl_slider`
---
    public function allData()
    {
        return $this->db->table('tbl_slider')->get()->getResultArray();