app/Views/v_template_front.php

<head>
  <?php
  $db = Config\Database::connect();
  $web = $db->table('tbl_kantor')->where('id', 1)->get()->getRowArray();
  $wilayah = $db->table('tbl_wilayah')->get()->getResultArray();
---
SELECT *
FROM `tbl_kantor`
WHERE `id` = 1
SELECT *
FROM `tbl_wilayah`